OpenFOAM-v2112/modules/OpenQBMM/tutorials/diluteVdfTransportFoam/bubbleColumn/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

continuousPhase water;
dilutePhase     air;
pMin 1e3;
air
{
    residualAlpha   1e-6;
    d 4.0e-3;
}
water
{
    residualAlpha   0;
    d 1e-4;
}

sigma 0.07;
aspectRatio
{
    type constant;
    E0   1.0;
}

drag
{
    type        TomiyamaCorrelated;
    A 24.0;
    residualRe  1e-4;

    swarmCorrection
    {
        type none;
    }
}
virtualMass
{
    type constantCoefficient;
    Cvm 0.5;
}
lift
{
    type Tomiyama;
}
wallLubrication
{
    type            Antal;
    Cw1             -0.01;
    Cw2             0.05;
    Cwc             10.0;
    Cwd             6.8;
    p               1.7;
}
turbulentDispersion
{
    type Panicker;
}
