OpenFOAM-v2112/modules/OpenQBMM/tutorials/diluteVdfTransportFoam/bubbleColumn/system/momentGenerationDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      momentGenerationDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (air);

boundaries
{
    inlet
    {
        type        fixedValue;
        value       uniform 0.0;
    }
    outlet
    {
        type        zeroGradient;
        phi         phi.air;
        inletValue  uniform 0;
    }
    walls
    {
        type        zeroGradient;
        value       uniform 0.0;
    }
}

air
{
    type                weightsAndAbscissae;
    weightDimension     [0 0 0 0 0 0 0];
    abscissaDimension0  [0 1 0 0 0 0 0];
    abscissaDimension   [0 1 -1 0 0 0 0];

//     "moment.*00Boundary"
//     {
//         inlet
//         {
//             type        fixedValue;
//             value       uniform 0.0;
//         }
//         outlet
//         {
//             type        inletOutlet;
//             phi         phi.air;
//             inletValue  uniform 0;
//         }
//         walls
//         {
//             type        zeroGradient;
//         }
//     }

    default
    {}

    inlet
    {
        node0
        {
            weight      uniform 0.033;
            abscissae   (3.5e-3 0 0.2);
        }
        node1
        {
            weight      uniform 0.034;
            abscissae   (4.0e-3 0 0.2);
        }
        node2
        {
            weight      uniform 0.033;
            abscissae   (4.3e-3 0 0.2);
        }
    }
}


// ************************************************************************* //
